app/Controllers/Keranjang.php

SELECT *
FROM `keranjang`
LEFT JOIN `produk` ON `produk`.`id_produk` = `keranjang`.`id_produk`
WHERE `id_user` = '7'
---
    public function index()
    {
        $sess_user = $this->session->get('LoggedUserData');

        $data_keranjang = $this->keranjangModel
            ->join('produk', 'produk.id_produk = keranjang.id_produk', 'LEFT')
            ->where('id_user', $sess_user['id_user'])
            ->get();

SELECT *
FROM `produk`
WHERE `id_produk` = '17'
 LIMIT 1
SELECT *
FROM `keranjang`
WHERE `id_user` = '7'
AND `id_produk` = '17'
 LIMIT 1
INSERT INTO `keranjang` (`id_produk`, `id_user`, `jumlah_beli`) VALUES ('17', '7', 1)
---
    private function tambahkan_keranjang()
    {
        $produkModel = new \App\Models\ProdukModel();

        // cek id produk valid atau tidak
        $cek_data_produk = $produkModel
        ->where('id_produk', $_GET['id_produk'])
        ->first();

        if ($cek_data_produk == null) {
            $proses_db = null;
        } else {
            $sess_user = $this->session->get('LoggedUserData');

            // cek produk sudah ada di keranjang user atau tidak
            $cek_keranjang = $this->keranjangModel
            ->where('id_user', $sess_user['id_user'])
            ->where('id_produk', $_GET['id_produk'])
            ->first();

            if ($cek_keranjang == null) {
                // insert data produk ke keranjang
                $data_inputan_keranjang = [
                    'id_produk' => $_GET['id_produk'],
                    'id_user' => $sess_user['id_user'],
                    'jumlah_beli' => 1
                ];

                $proses_db = $this->keranjangModel->insert($data_inputan_keranjang);

SELECT *
FROM `keranjang`
WHERE `id_user` = '7'
SELECT *
FROM `keranjang`
WHERE `id_user` = '7'
AND `id_produk` = ('17')
UPDATE `keranjang` SET `jumlah_beli` = '2'
WHERE `keranjang`.`id_keranjang` IN ('26')
---
    public function checkout()
    {
        $sess_user = $this->session->get('LoggedUserData');
        $id_produks = $_GET['id_produks'];
        $jumlah_beli = $_GET['jumlah_beli'];

        $data_view = [
            'data_keranjang' => $this->keranjangModel
            ->where('id_user', $sess_user['id_user'])
            ->get()->getResult(),
            'total' => 0
        ];

        if ($id_produks && $jumlah_beli) {
            $cek_keranjang = $this->keranjangModel
                ->where('id_user', $sess_user['id_user'])
                ->where('id_produk', $id_produks)
                ->get();

                $data_view = [
                    'data_keranjang' => $cek_keranjang->getResult(),
                    'total' => 0
                ];

                foreach ($cek_keranjang->getResult() as $key => $value) {
                    $data_inputan_keranjang = [
                        'jumlah_beli' => $jumlah_beli[$key]
                    ];

                    $this->keranjangModel->update($value->id_keranjang, $data_inputan_keranjang);

SELECT *
FROM `produk`
WHERE `id_produk` IN ('17')
---
        // menghitung total bayar
        $produkModel = new \App\Models\ProdukModel();

        $cek_data_produk = $produkModel
        ->whereIn('id_produk', $id_produks)
        ->get();

SELECT *
FROM `keranjang`
LEFT JOIN `produk` ON `produk`.`id_produk` = `keranjang`.`id_produk`
WHERE `id_keranjang` IN ('26')
AND `id_user` = '7'
---
    public function checkout_proses()
    {
        $transModel = new \App\Models\TransaksiModel();
        $detailTransModel = new \App\Models\DetailTransModel();

        $sess_user = $this->session->get('LoggedUserData');

        $id_keranjangs = $this->request->getPost('id_keranjangs');

        // mengambil data keranjang milik user
        $data_keranjang = $this->keranjangModel
            ->join('produk', 'produk.id_produk = keranjang.id_produk', 'LEFT')
            ->whereIn('id_keranjang',$id_keranjangs)
            ->where('id_user', $sess_user['id_user'])
            ->get();

INSERT INTO `transaksi` (`id_user`, `tgl_transaksi`, `total_bayar`, `nama`, `alamat_jalan`, `kecamatan`, `kota`, `provinsi`) VALUES ('7', '2024-07-04', 580000, 'Nurul', 'sucen', 'Mlati', 'Turi', 'Daerah Istimewa yogyakarta')
---
                    'provinsi' => $this->request->getPost('provinsi'),
                ];

                $proses_db_trans = $transModel->insert($data_transaksi);

DELETE FROM `keranjang`
WHERE `id_user` = '7'
---
        }

        // setelah semua dimasukkan ke tabel transaki dan detail, data keranjang user dihapus / direset
        $proses_db_keranjang = $this->keranjangModel
        ->where('id_user', $sess_user['id_user'])
        ->delete();

SELECT *
FROM `transaksi`
WHERE `id_user` = '7'
ORDER BY `id_transakSi` DESC
---
    public function transaksi()
    {
        $transModel = new \App\Models\TransaksiModel();

        $sess_user = $this->session->get('LoggedUserData');

        $data_trans = $transModel
            ->where('id_user', $sess_user['id_user'])
            ->orderBy('id_transakSi', 'desc')
            ->get();